{
  "html": {
    "title": "HTML",
    "description": "HTML é uma linguagem de marcação, sendo responsável por estruturar o conteúdo da web. Ele que define os elementos da página, como títulos, parágrafos, links, imagens e formulários, garantindo acessibilidade e compatibilidade com diferentes navegadores e dispositivos e trabalhando em conjunto com o CSS para a criação de interfaces."
  },
  "css": {
    "title": "CSS",
    "description": "CSS é a linguagem que complementa o HTML, encarregando-se da estilização e da aparência de toda a página. Com ela, é possível ter total controle sobre o layout, estabelecendo cores, formatos, tipografia, animações e responsividade, o que possibilita a criação de interfaces modernas, intuitivas e ajustáveis a diferentes tipos de tela."
  },
  "javascript": {
    "title": "JavaScript",
    "description": "JavaScript é uma das principais linguagens de programação, sendo a mais usada na programação web. Ela é responsável pela interatividade, lógica e comportamento dinâmico das aplicações, além de permitir manipular o DOM, consumir APIs e validar dados, sendo de extrema importância para a criação de qualquer site."
  },
  "typescript": {
    "title": "TypeScript",
    "description": "TypeScript é uma linguagem de programação que permite a tipagem em códigos Javascript, ajudando a evitar erros no ambiente de desenvolvimento. Ele também melhora a leitura de códigos e manutenção de aplicações, sendo usado principalmente em projetos de médio e grande porte."
  },
  "sass": {
    "title": "Sass",
    "description": "Sass é um pré-processador do CSS que expande as funcionalidades da linguagem, permitindo o uso de variáveis, funções, aninhamento de regras, entre outros. O uso de Sass facilita a organização de código e torna a estilização mais reutilizável e fácil de manter."
  },
  "react": {
    "title": "React",
    "description": "React se trata de uma biblioteca JavaScript voltada para a criação de interfaces usando componentes reutilizáveis. Criada pelo Facebook, é uma forma eficiente de manter o código organizado e mais fácil de realizar manutenções, tornando o ambiente de desenvolvimento de aplicações muito mais dinâmico e prático."
  },
  "tailwind": {
    "title": "Tailwind CSS",
    "description": "Tailwind CSS é um framework que funciona fornecendo classes prontas para estilização direta pelo HTML do projeto. Ele permite desenvolver interfaces de forma rápida, mantendo a consistência visual e o alto nível de customização do CSS, porém sem a necessidade de escrever muito CSS manual."
  },
  "styledcomponents": {
    "title": "Styled Components",
    "description": "Styled Components é uma biblioteca JavaScript que permite escrever estilos dentro de componentes React, possibilitando uma ampla reutilização de código, além de oferecer recursos como suporte a temas, estilização de componentes de outras bibliotecas e estilizações globais, mantendo a manutenção dos estilos muito mais simples em aplicações complexas."
  },
  "axios": {
    "title": "Axios",
    "description": "Axios é uma biblioteca JavaScript focada na realização de requisições HTTP, simplificando o consumo de APIs, além de oferecer suporte a promises, interceptadores, tratamento de erros e configuração de requisições, sendo uma forma mais prática e facilitada de integrar APIs na aplicação."
  },
  "materialui": {
    "title": "Material UI",
    "description": "Material UI se trata de uma biblioteca de componentes em React baseada no Material Design do Google. Ela oferece componentes prontos acessíveis e customizáveis, sendo uma forma de acelerar o desenvolvimento de interfaces com componentes reutilizáveis de fácil configuração."
  },
  "framermotion": {
    "title": "Framer Motion",
    "description": "Framer Motion é uma biblioteca de animações desenvolvida para o React, oferecendo uma forma mais prática e intuitiva de criar transições e interações fluidas, sendo capaz de animar componentes inteiros sem afetar a performance e melhorando a experiência de usuário."
  },
  "vscode": {
    "title": "Visual Studio Code",
    "description": "Visual Studio Code é um editor de código rápido e altamente personalizável. Ele oferece suporte a diversas linguagens, possuindo integração com Git e uma vasta biblioteca de extensões que aumentam a produtividade no desenvolvimento, permitindo que o ambiente seja modificado a gosto do desenvolvedor."
  },
  "git": {
    "title": "Git",
    "description": "Git é um sistema de controle de versão que permite o rastreamento de mudanças no código ao longo do tempo, facilitando o trabalho em equipe, o versionamento e o gerenciamento de diferentes fluxos de desenvolvimento, além de ajudar a evitar conflitos de código."
  },
  "mysql": {
    "title": "MySQL",
    "description": "MySQL é um sistema de gerenciamento de banco de dados amplamente utilizado em aplicações web. Esse sistema permite o armazenamento, organização e consulta de dados de forma eficiente, sendo bastante conhecido pela sua confiabilidade e seu desempenho."
  }
}
